const services = [
  {
    title: 'Апартаменти',
    img: 'flat.jpg',
    link: '/services/flats',
    points: [
      'Почистване на подове и повърхности',
      'Пране на мека мебел',
      'Дезинфекция и ароматизация'
    ]
  },
  {
    title: 'Къщи',
    img: 'house.webp',
    link: '/services/houses',
    points: [
      'Почистване след ремонт',
      'Обработка на труднодостъпни зони',
      'Грижа за различни повърхности'
    ]
  },
  {
    title: 'Офиси',
    img: 'office.jpg',
    link: '/services/offices',
    points: [
      'Редовно почистване',
      'Поддръжка на санитарни помещения',
      'Почистване на прозорци и бюра'
    ]
  },
  {
    title: 'Автомобили',
    img: 'car.jpg',
    link: '/services/cars',
    points: [
      'Пране на тапицерия',
      'Почистване на детайли',
      'Полиране и освежаване'
    ]
  },
  {
    title: 'Входове',
    img: 'entrance.jpg',
    link: '/services/entrances',
    points: [
      'Почистване на стълбища',
      'Измиване на прозорци',
      'Дезинфекция на общи части'
    ]
  },
  {
    title: 'Дворове',
    img: 'backyard.webp',
    link: '/services/backyards',
    points: [
      'Почистване на плочници',
      'Събиране на отпадъци',
      'Обработка срещу плевели'
    ]
  },
  {
    title: 'Заведения',
    img: 'restaurants.jpg',
    link: '/services/restaurants',
    points: [
      'Почистване на кухненски зони и оборудване',
      'Дезинфекция на работни повърхности',
      'Почистване на зали и санитарни помещения'
    ]
  },
  {
    title: 'Гаражи и паркоместа',
    img: 'garages.webp',
    link: '/services/garages',
    points: [
      'Обработка на замърсени подови настилки',
      'Премахване на масла, сажди и прах',
      'Почистване на врати, врати и технически инсталации'
    ]
  },
  {
    title: 'Специализирани обекти',
    img: 'specialized.jpg',
    link: '/services/specialized',
    points: [
      'Салони за красота и фризьорски салони',
      'Фитнес зали и спортни центрове',
      'Игрални зали',
      'Фото и видео студиа',
      'Цехове и работилници',
    ]
  }
];

export default services;
