export const garageTypes = ['Единично място', 'Двоен гараж', 'Подземен паркинг'];

export const subscriptionTypes = ['Еднократно', 'Седмично', 'Месечно'];

export const plans = [
  {
    name: 'Базов',
    prices: {
      'Единично място': { 'Еднократно': 39, 'Седмично': 34, 'Месечно': 30 },
      'Двоен гараж': { 'Еднократно': 49, 'Седмично': 44, 'Месечно': 39 },
      'Подземен паркинг': { 'Еднократно': 69, 'Седмично': 59, 'Месечно': 55 }
    },
    features: ['Почистване на пода', 'Измитане на прах и боклук', 'Измиване на врата']
  },
  {
    name: 'Стандартен',
    prices: {
      'Единично място': { 'Еднократно': 59, 'Седмично': 49, 'Месечно': 45 },
      'Двоен гараж': { 'Еднократно': 69, 'Седмично': 59, 'Месечно': 55 },
      'Подземен паркинг': { 'Еднократно': 89, 'Седмично': 79, 'Месечно': 75 }
    },
    features: ['Под + стени', 'Измиване на рампа', 'Почистване на осветление и уреди']
  },
  {
    name: 'Премиум',
    prices: {
      'Единично място': { 'Еднократно': 79, 'Седмично': 69, 'Месечно': 65 },
      'Двоен гараж': { 'Еднократно': 99, 'Седмично': 89, 'Месечно': 85 },
      'Подземен паркинг': { 'Еднократно': 119, 'Седмично': 109, 'Месечно': 105 }
    },
    features: ['Премахване на петна от масла', 'Дезинфекция', 'Почистване на врата и автоматизация']
  }
];

export const activities = [
  {
    name: 'Почистване на пода',
    prices: {
      'Единично място': { 'Еднократно': 15, 'Седмично': 12, 'Месечно': 10 },
      'Двоен гараж': { 'Еднократно': 20, 'Седмично': 16, 'Месечно': 14 },
      'Подземен паркинг': { 'Еднократно': 30, 'Седмично': 25, 'Месечно': 22 }
    }
  },
  {
    name: 'Измиване на стени и врата',
    prices: {
      'Единично място': { 'Еднократно': 10, 'Седмично': 8, 'Месечно': 7 },
      'Двоен гараж': { 'Еднократно': 15, 'Седмично': 12, 'Месечно': 10 },
      'Подземен паркинг': { 'Еднократно': 20, 'Седмично': 16, 'Месечно': 14 }
    }
  },
  {
    name: 'Премахване на петна от масла',
    prices: {
      'Единично място': { 'Еднократно': 20, 'Седмично': 17, 'Месечно': 15 },
      'Двоен гараж': { 'Еднократно': 25, 'Седмично': 22, 'Месечно': 20 },
      'Подземен паркинг': { 'Еднократно': 35, 'Седмично': 30, 'Месечно': 27 }
    }
  },
  {
    name: 'Почистване на осветление и контакти',
    prices: {
      'Единично място': { 'Еднократно': 10, 'Седмично': 8, 'Месечно': 7 },
      'Двоен гараж': { 'Еднократно': 15, 'Седмично': 12, 'Месечно': 10 },
      'Подземен паркинг': { 'Еднократно': 20, 'Седмично': 16, 'Месечно': 14 }
    }
  },
  {
    name: 'Дезинфекция и ароматизация',
    prices: {
      'Единично място': { 'Еднократно': 8, 'Седмично': 7, 'Месечно': 6 },
      'Двоен гараж': { 'Еднократно': 10, 'Седмично': 9, 'Месечно': 8 },
      'Подземен паркинг': { 'Еднократно': 12, 'Седмично': 10, 'Месечно': 9 }
    }
  }
];
