export const officeTypes = ['Малък офис', 'Среден офис', 'Голям офис'];

export const subscriptionTypes = ['Еднократно', 'Седмично', 'Месечно'];

export const plans = [
  {
    name: 'Базов',
    prices: {
      'Малък офис': { 'Еднократно': 69, 'Седмично': 59, 'Месечно': 55 },
      'Среден офис': { 'Еднократно': 89, 'Седмично': 79, 'Месечно': 75 },
      'Голям офис': { 'Еднократно': 109, 'Седмично': 99, 'Месечно': 95 }
    },
    features: ['Почистване на подове', 'Измиване на прозорци', 'Изхвърляне на отпадъци']
  },
  {
    name: 'Стандартен',
    prices: {
      'Малък офис': { 'Еднократно': 99, 'Седмично': 89, 'Месечно': 85 },
      'Среден офис': { 'Еднократно': 119, 'Седмично': 109, 'Месечно': 105 },
      'Голям офис': { 'Еднократно': 139, 'Седмично': 129, 'Месечно': 125 }
    },
    features: ['Пълно почистване', 'Прозорци и мебели', 'Тоалетни и кухня']
  },
  {
    name: 'Премиум',
    prices: {
      'Малък офис': { 'Еднократно': 129, 'Седмично': 119, 'Месечно': 115 },
      'Среден офис': { 'Еднократно': 149, 'Седмично': 139, 'Месечно': 135 },
      'Голям офис': { 'Еднократно': 169, 'Седмично': 159, 'Месечно': 155 }
    },
    features: ['Дезинфекция', 'Почистване на техника', 'Пране на мокети', 'Пълно почистване']
  }
];

export const activities = [
  {
    name: 'Почистване на подове',
    prices: {
      'Малък офис': { 'Еднократно': 20, 'Седмично': 18, 'Месечно': 16 },
      'Среден офис': { 'Еднократно': 30, 'Седмично': 26, 'Месечно': 24 },
      'Голям офис': { 'Еднократно': 40, 'Седмично': 34, 'Месечно': 30 }
    }
  },
  {
    name: 'Почистване на бюра и мебели',
    prices: {
      'Малък офис': { 'Еднократно': 25, 'Седмично': 20, 'Месечно': 18 },
      'Среден офис': { 'Еднократно': 35, 'Седмично': 28, 'Месечно': 25 },
      'Голям офис': { 'Еднократно': 45, 'Седмично': 36, 'Месечно': 32 }
    }
  },
  {
    name: 'Измиване на прозорци',
    prices: {
      'Малък офис': { 'Еднократно': 25, 'Седмично': 22, 'Месечно': 20 },
      'Среден офис': { 'Еднократно': 35, 'Седмично': 30, 'Месечно': 28 },
      'Голям офис': { 'Еднократно': 45, 'Седмично': 38, 'Месечно': 35 }
    }
  },
  {
    name: 'Почистване на тоалетни и кухня',
    prices: {
      'Малък офис': { 'Еднократно': 30, 'Седмично': 26, 'Месечно': 24 },
      'Среден офис': { 'Еднократно': 40, 'Седмично': 34, 'Месечно': 30 },
      'Голям офис': { 'Еднократно': 50, 'Седмично': 42, 'Месечно': 38 }
    }
  },
  {
    name: 'Дезинфекция и ароматизация',
    prices: {
      'Малък офис': { 'Еднократно': 20, 'Седмично': 18, 'Месечно': 15 },
      'Среден офис': { 'Еднократно': 30, 'Седмично': 25, 'Месечно': 22 },
      'Голям офис': { 'Еднократно': 40, 'Седмично': 32, 'Месечно': 28 }
    }
  }
];
